2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_tim.c
/**
*     Copyright (c) 2025, Nsing Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nsing Technologies Inc. (Hereinafter 
* referred to as Nsing). This software, and the product of Nsing described herein 
* (Hereinafter referred to as the Product) are owned by Nsing under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     Nsing does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     Nsing reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact Nsing and obtain 
* the latest version of this software before placing orders.

*     Although Nsing has attempted to provide accurate and reliable information, Nsing assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall Nsing be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     Nsing Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify Nsing and hold Nsing 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by Nsing, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     Nsing products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/

/**
*\*\file n32g033_tim.c
*\*\author Nsing
*\*\version v1.0.0
*\*\copyright Copyright (c) 2025, Nsing Technologies Inc. All rights reserved.
**/


#include "n32g033_tim.h"
#include "n32g033_rcc.h"

/**
*\*\name    TIM_DeInit
*\*\fun     Deinitializes the TIM_OUTPWM registers.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\return  none
**/
void TIM_DeInit(TIM_Module* TIM_OUTPWM)
{
    if(TIM_OUTPWM == TIM1)
    {
        RCC_EnableAPBPeriphReset(RCC_APB_PERIPH_TIM1);
    }     
    else if(TIM_OUTPWM == TIM3)
    {
        RCC_EnableAPBPeriphReset(RCC_APB_PERIPH_TIM3);
    }
    else if(TIM_OUTPWM == TIM4)
    {
        RCC_EnableAPBPeriphReset(RCC_APB_PERIPH_TIM4);
    }
    else if(TIM_OUTPWM == TIM6)
    {
        RCC_EnableAPBPeriphReset(RCC_APB_PERIPH_TIM6);
    }   
    else
    {
        /* No process */
    }
}

/**
*\*\name    TIM_InitTimeBase
*\*\fun     Initializes the TIM_OUTPWM time base unit.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\param   TIM_TimeBaseInitStruct: refer to the definition of TIM_TimeBaseInitType
*\*\          - Prescaler
*\*\            * 0x0000 ~ 0xFFFF
*\*\          - CounterMode
*\*\            * TIM_CNT_MODE_UP
*\*\            * TIM_CNT_MODE_DOWN
*\*\            * TIM_CNT_MODE_CENTER_ALIGN1
*\*\            * TIM_CNT_MODE_CENTER_ALIGN2
*\*\            * TIM_CNT_MODE_CENTER_ALIGN3
*\*\          - Period
*\*\            * 0x00000000 ~ 0xFFFFFFFF
*\*\          - ClkDiv
*\*\            * 0x00~ 0x1F
*\*\          - RepetCnt
*\*\            * 0x00 ~ 0xFF
*\*\          - CapCh1Sel
*\*\            * TIM_CAPCH1SEL_IOM
*\*\            * TIM_CAPCH1SEL_COMP
*\*\          - EtrOrClr
*\*\            * TIM_ETRSEL
*\*\            * TIM_COMPSEL
*\*\return  none
**/
void TIM_InitTimeBase(TIM_Module* TIM_OUTPWM, TIM_TimeBaseInitType* TIM_TimeBaseInitStruct)
{
    uint32_t tmpctrl1;
    tmpctrl1 = TIM_OUTPWM->CTRL1;  
    
    if ((TIM_OUTPWM == TIM1) || (TIM_OUTPWM == TIM3) || (TIM_OUTPWM == TIM4)) 
    {
        /* Select the Counter Mode */
        tmpctrl1 &= (uint32_t)(~(TIM_CTRL1_DIR | TIM_CTRL1_CAMSEL));
        tmpctrl1 |= (uint32_t)TIM_TimeBaseInitStruct->CounterMode;
    }
    if (TIM_OUTPWM == TIM1) 
    {
        /* Set the clock division */
        tmpctrl1 &= (uint32_t)(~TIM_CTRL1_CLKD);
        tmpctrl1 |= (uint32_t)TIM_TimeBaseInitStruct->ClkDiv;
    }    
    TIM_OUTPWM->CTRL1 = tmpctrl1;    
    
    /* Set the Autoreload value */
    TIM_OUTPWM->AR = TIM_TimeBaseInitStruct->Period ;

    /* Set the Prescaler value */
    TIM_OUTPWM->PSC = TIM_TimeBaseInitStruct->Prescaler;    
    
    if (TIM_OUTPWM == TIM1) 
    {
        /* Set the Repetition Counter value */
        TIM_OUTPWM->REPCNT = TIM_TimeBaseInitStruct->RepetCnt;
    }

    /* Generate an update event to reload the Prescaler and the Repetition counter
     values immediately */
    TIM_OUTPWM->EVTGEN = TIM_PSC_RELOAD_MODE_IMMEDIATE;
    
    /* Channel 1 & OCxclr select capture in */
    tmpctrl1 = TIM_OUTPWM->CTRL1;  

    /* Channel 1 select capture in */
    tmpctrl1 &= (uint32_t)(~TIM_CTRL1_C1SEL);
    tmpctrl1 |= (uint32_t)TIM_TimeBaseInitStruct->CapCh1Sel;
    
    /* COMP or ETR select capture in */
    tmpctrl1 &= (uint32_t)(~TIM_CTRL1_CLRSEL);
    tmpctrl1 |= (uint32_t)TIM_TimeBaseInitStruct->EtrOrClr;        

        
    TIM_OUTPWM->CTRL1 = tmpctrl1; 
}

/**
*\*\name    TIM_InitOc1
*\*\fun     Initializes the TIM_OUTPWM Channel 1.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   TIM_OCInitStruct: refer to the definition of OCInitType
*\*\          - OCMode
*\*\            * TIM_OCMODE_TIMING
*\*\            * TIM_OCMODE_ACTIVE
*\*\            * TIM_OCMODE_INACTIVE
*\*\            * TIM_OCMODE_TOGGLE
*\*\            * TIM_FORCED_ACTION_INACTIVE
*\*\            * TIM_FORCED_ACTION_ACTIVE
*\*\            * TIM_OCMODE_PWM1
*\*\            * TIM_OCMODE_PWM2
*\*\          - OutputState
*\*\            * TIM_OUTPUT_STATE_DISABLE
*\*\            * TIM_OUTPUT_STATE_ENABLE
*\*\          - OutputNState
*\*\            * TIM_OUTPUT_NSTATE_DISABLE
*\*\            * TIM_OUTPUT_NSTATE_ENABLE
*\*\          - Pulse
*\*\            * 0x00000000 ~ 0xFFFFFFFF
*\*\          - OCPolarity
*\*\            * TIM_OC_POLARITY_HIGH
*\*\            * TIM_OC_POLARITY_LOW
*\*\          - OCNPolarity
*\*\            * TIM_OCN_POLARITY_HIGH
*\*\            * TIM_OCN_POLARITY_LOW
*\*\          - OCIdleState
*\*\            * TIM_OC_IDLE_STATE_SET
*\*\            * TIM_OC_IDLE_STATE_RESET
*\*\          - OCNIdleState
*\*\            * TIM_OCN_IDLE_STATE_SET
*\*\            * TIM_OCN_IDLE_STATE_RESET
*\*\return  none
**/
void TIM_InitOc1(TIM_Module* TIM_OUTPWM, OCInitType* TIM_OCInitStruct)
{
    uint32_t tmpccmodx;
    uint32_t tmpccen, tmpctrl2;

    /* Disable the Channel 1: Reset the CC1EN Bit */
    TIM_OUTPWM->CCEN &= (uint32_t)(~TIM_CCEN_CC1EN);    
    /* Get the TIMx_CCEN register value */
    tmpccen = TIM_OUTPWM->CCEN;    
    /* Get the TIMx_CTRL2 register value */
    tmpctrl2 =  TIM_OUTPWM->CTRL2;
    /* Get the TIMx_CCMOD1 register value */
    tmpccmodx = TIM_OUTPWM->CCMOD1;

    /* Reset the Output Compare Mode Bits */
    tmpccmodx &= (uint32_t)(~TIM_CCMOD1_OC1MD); 
    tmpccmodx &= (uint32_t)(~TIM_CCMOD1_CC1SEL);    
    /* Select the Output Compare Mode */
    tmpccmodx |= (uint32_t)(TIM_OCInitStruct->OCMode);

    /* Reset the Output Polarity level */
    tmpccen &= (uint32_t)(~TIM_CCEN_CC1P);    
    /* Set the Output Compare Polarity */
    tmpccen |= (uint32_t)(TIM_OCInitStruct->OCPolarity);
    /* Set the Output State */
    tmpccen |= (uint32_t)(TIM_OCInitStruct->OutputState);
    
