2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_tim.c
    /* Get the TIM_OUTPWM SMCTRL register value */
    tmpsmctrl = TIM_OUTPWM->SMCTRL;
    /* Reset the SMS Bits */
    tmpsmctrl &= (uint32_t)(~((uint32_t)TIM_SMCTRL_SMSEL));
    /* Select the External clock mode1 */
    tmpsmctrl |= (uint32_t)TIM_SLAVE_MODE_EXT1;
    /* Select the Trigger selection : ETRF */
    tmpsmctrl &= (uint32_t)(~((uint32_t)TIM_SMCTRL_TSEL));
    tmpsmctrl |= (uint32_t)TIM_TRIG_SEL_ETRF;
    /* Write to TIM_OUTPWM SMCTRL */
    TIM_OUTPWM->SMCTRL = tmpsmctrl;
}

/**
*\*\name    TIM_ConfigExtClkMode2
*\*\fun     Configures the External clock Mode2
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   TIM_ExtTRGPrescaler:
*\*\          - TIM_EXT_TRG_PSC_OFF
*\*\          - TIM_EXT_TRG_PSC_DIV2
*\*\          - TIM_EXT_TRG_PSC_DIV4
*\*\          - TIM_EXT_TRG_PSC_DIV8
*\*\param   TIM_ExtTRGPolarity
*\*\          - TIM_EXT_TRIG_POLARITY_INVERTED
*\*\          - TIM_EXT_TRIG_POLARITY_NONINVERTED
*\*\param   ExtTRGFilter
*\*\          - ExtTRGFilter can be a number between 0x0 and 0xF
*\*\return  none
**/
void TIM_ConfigExtClkMode2(TIM_Module* TIM_OUTPWM,uint32_t TIM_ExtTRGPrescaler,uint32_t TIM_ExtTRGPolarity,uint32_t ExtTRGFilter)
{
    /* Configure the ETR Clock source */
    TIM_ConfigExtTrig(TIM_OUTPWM, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter);
    /* Enable the External clock mode2 */
    TIM_OUTPWM->SMCTRL |= (uint32_t)TIM_SMCTRL_EXCEN;
}

/**
*\*\name    TIM_ConfigPrescaler
*\*\fun     Configures the TIM_OUTPWM Prescaler.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\param   Prescaler:
*\*\          - 0x0000 ~ 0xFFFF
*\*\param   TIM_PSCReloadMode
*\*\          - TIM_PSC_RELOAD_MODE_UPDATE
*\*\          - TIM_PSC_RELOAD_MODE_IMMEDIATE
*\*\return  none
**/
void TIM_ConfigPrescaler(TIM_Module* TIM_OUTPWM, uint32_t Prescaler, uint32_t TIM_PSCReloadMode)
{
    /* Set the Prescaler value */
    TIM_OUTPWM->PSC = Prescaler;
    /* Set or reset the UG Bit */
    TIM_OUTPWM->EVTGEN = TIM_PSCReloadMode;
}

/**
*\*\name    TIM_ConfigCntMode
*\*\fun     Specifies the TIM_OUTPWM Counter Mode to be used.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   CntMode
*\*\          - TIM_CNT_MODE_UP
*\*\          - TIM_CNT_MODE_DOWN
*\*\          - TIM_CNT_MODE_CENTER_ALIGN1
*\*\          - TIM_CNT_MODE_CENTER_ALIGN2
*\*\          - TIM_CNT_MODE_CENTER_ALIGN3
*\*\return  none
**/
void TIM_ConfigCntMode(TIM_Module* TIM_OUTPWM, uint32_t CntMode)
{
    uint32_t tmpctrl1 ;
    tmpctrl1 = TIM_OUTPWM->CTRL1;
    /* Reset the CMS and DIR Bits */
    tmpctrl1 &= (uint32_t)(~((uint32_t)(TIM_CTRL1_DIR | TIM_CTRL1_CAMSEL)));
    /* Set the Counter Mode */
    tmpctrl1 |= (uint32_t)CntMode;
    /* Write to TIM_OUTPWM CTRL1 register */
    TIM_OUTPWM->CTRL1 = tmpctrl1;
}

/**
*\*\name    TIM_ConfigEncoderInterface
*\*\fun     Configures the TIM_OUTPWM Encoder Interface.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\param   TIM_EncoderMode
*\*\          - TIM_ENCODE_QUA_MODE_TI1
*\*\          - TIM_ENCODE_QUA_MODE_TI2
*\*\          - TIM_ENCODE_QUA_MODE_TI12
*\*\param   TIM_IC1Polarity
*\*\          - TIM_IC_POLARITY_FALLING
*\*\          - TIM_IC_POLARITY_RISING
*\*\param   TIM_IC2Polarity
*\*\          - TIM_IC_POLARITY_FALLING
*\*\          - TIM_IC_POLARITY_RISING
*\*\return  none
**/
void TIM_ConfigEncoderInterface(TIM_Module* TIM_OUTPWM,uint32_t TIM_EncoderMode,uint32_t TIM_IC1Polarity,uint32_t TIM_IC2Polarity)
{
    uint32_t tmpsmctrl  ;
    uint32_t tmpccmodx ;
    uint32_t tmpccen  ;
    /* Get the TIM_OUTPWM SMCTRL register value */
    tmpsmctrl = TIM_OUTPWM->SMCTRL;

    /* Get the TIM_OUTPWM CCMOD1 register value */
    tmpccmodx = TIM_OUTPWM->CCMOD1;

    /* Get the TIM_OUTPWM CCEN register value */
    tmpccen = TIM_OUTPWM->CCEN;

    /* Set the encoder Mode */
    tmpsmctrl &= (uint32_t)(~((uint32_t)TIM_SMCTRL_SMSEL));
    tmpsmctrl |= (uint32_t)TIM_EncoderMode;

    /* Select the Capture Compare 1 and the Capture Compare 2 as input */
    tmpccmodx &= (uint32_t)((~TIM_CCMOD1_CC1SEL) & (~TIM_CCMOD1_CC2SEL));
    tmpccmodx |= (uint32_t)(TIM_CCMOD1_CC1SEL_0 | TIM_CCMOD1_CC2SEL_0);

    /* Set the TI1 and the TI2 Polarities */
    tmpccen &= (uint32_t)(((uint32_t) ~((uint32_t)TIM_CCEN_CC1P)) & ((uint32_t) ~((uint32_t)TIM_CCEN_CC2P)));
    tmpccen |= (uint32_t)(TIM_IC1Polarity | (uint32_t)(TIM_IC2Polarity << (uint32_t)4));

    /* Write to TIM_OUTPWM SMCTRL */
    TIM_OUTPWM->SMCTRL = tmpsmctrl;
    /* Write to TIM_OUTPWM CCMOD1 */
    TIM_OUTPWM->CCMOD1 = tmpccmodx;
    /* Write to TIM_OUTPWM CCEN */
    TIM_OUTPWM->CCEN = tmpccen;
}

/**
*\*\name    TIM_ConfigEncoderInterface2
*\*\fun     Configures the TIM_OUTPWM Encoder Interface.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM4
*\*\param   TIM_EncoderMode
*\*\          - TIM_ENCODE2_QUA_MODE_TI1
*\*\          - TIM_ENCODE2_QUA_MODE_TI2
*\*\          - TIM_ENCODE2_QUA_MODE_TI12
*\*\          - TIM_ENCODE2_QUA_MODE_SINGLE_TI1
*\*\          - TIM_ENCODE2_QUA_MODE_SINGLE_TI2
*\*\          - TIM_ENCODE2_DUL_CLKPLUS_MODE1
*\*\          - TIM_ENCODE2_DUL_CLKPLUS_MODE2
*\*\          - TIM_ENCODE2_SINGLE_CLKPLUS_MODE1
*\*\          - TIM_ENCODE2_SINGLE_CLKPLUS_MODE2
*\*\          - TIM_ENCODE2_CCW_MODE1
*\*\          - TIM_ENCODE2_CCW_MODE2
*\*\param   TIM_IC1Polarity
*\*\          - TIM_IC_POLARITY_FALLING
*\*\          - TIM_IC_POLARITY_RISING
*\*\param   TIM_IC2Polarity
*\*\          - TIM_IC_POLARITY_FALLING
*\*\          - TIM_IC_POLARITY_RISING
*\*\return  none
**/
void TIM_ConfigEncoderInterface2(TIM_Module* TIM_OUTPWM,uint32_t TIM_EncoderMode,uint32_t TIM_IC1Polarity,uint32_t TIM_IC2Polarity)
{
    uint32_t tmpccmodx ;
    uint32_t tmpccen  ;
    uint32_t tmpencmctrl  ;

    /* Get the TIM_OUTPWM CCMOD1 register value */
    tmpccmodx = TIM_OUTPWM->CCMOD1;

    /* Get the TIM_OUTPWM CCEN register value */
    tmpccen = TIM_OUTPWM->CCEN;

    /* Get the TIM_OUTPWM ENCMCTRL register value */
    tmpencmctrl = TIM_OUTPWM->ENCMCTRL;

    /* Set the encoder Mode */
    tmpencmctrl &= (uint32_t)(~((uint32_t)TIM_ENCMCTRL_ENCMD));
    tmpencmctrl |= (uint32_t)TIM_EncoderMode;        

