2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_tim.c
/**
*\*\name    TIM_ClrOc7Ref
*\*\fun     Clears or safeguards the OCREF7 signal on an external event
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   TIM_OCPreload
*\*\          - TIM_OC_CLR_ENABLE
*\*\          - TIM_OC_CLR_DISABLE
*\*\return  none
**/
void TIM_ClrOc7Ref(TIM_Module* TIM_OUTPWM, uint32_t TIM_OCClear)
{
    uint32_t tmpccmodx ;
    tmpccmodx = TIM_OUTPWM->CCMOD3;
    /* Reset the OC4CEN Bit */
    tmpccmodx &= (uint32_t)(~TIM_CCMOD3_OC7CEN);
    /* Enable or Disable the Output Compare Clear Bit */
    tmpccmodx |= (uint32_t)(TIM_OCClear << 14);
    /* Write to TIM_OUTPWM CCMOD3 register */
    TIM_OUTPWM->CCMOD3 = tmpccmodx;
}

/**
*\*\name    TIM_ClrOcRefInputSource
*\*\fun     Set the OCREF clear input source
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   OCRefClearInputSource
*\*\          - TIM_ETRSEL
*\*\          - TIM_COMPSEL
*\*\return  none
**/
void TIM_ClrOcRefInputSource(TIM_Module* TIM_OUTPWM, uint32_t OCRefClearInputSource)
{
    uint32_t tmpctrl1 ; 
    /* Get the value of TIMx_CTRL1 */
    tmpctrl1 = TIM_OUTPWM->CTRL1;      
    /* Reset the CTRL1_CLRSEL bits */
    tmpctrl1 &= (uint32_t)(~TIM_CTRL1_CLRSEL);
    
    /* CLR select capture in */
    tmpctrl1 |= (uint32_t)OCRefClearInputSource;            
    TIM_OUTPWM->CTRL1 = tmpctrl1;
}

/**
*\*\name    TIM_ConfigOc1Polarity
*\*\fun     Configures the TIM_OUTPWM channel 1 polarity.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   TIM_OCPreload
*\*\          - TIM_OC_POLARITY_HIGH
*\*\          - TIM_OC_POLARITY_LOW
*\*\return  none
**/
void TIM_ConfigOc1Polarity(TIM_Module* TIM_OUTPWM, uint32_t OcPolarity)
{
    uint32_t tmpccen ;
    tmpccen = TIM_OUTPWM->CCEN;
    /* Set or Reset the CC1P Bit */
    tmpccen &= (uint32_t)(~((uint32_t)TIM_CCEN_CC1P));
    tmpccen |= (uint32_t)OcPolarity;
    /* Write to TIM_OUTPWM CCEN register */
    TIM_OUTPWM->CCEN = tmpccen;
}

/**
*\*\name    TIM_ConfigOc1NPolarity
*\*\fun     Configures the TIM_OUTPWM channel 1N polarity.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   TIM_OCPreload
*\*\          - TIM_OCN_POLARITY_HIGH
*\*\          - TIM_OCN_POLARITY_LOW
*\*\return  none
**/
void TIM_ConfigOc1NPolarity(TIM_Module* TIM_OUTPWM, uint32_t OcNPolarity)
{
    uint32_t tmpccen ;
    tmpccen = TIM_OUTPWM->CCEN;
    /* Set or Reset the CC1NP Bit */
    tmpccen &= (uint32_t)(~((uint32_t)TIM_CCEN_CC1NP));
    tmpccen |= (uint32_t)OcNPolarity;
    /* Write to TIM_OUTPWM CCEN register */
    TIM_OUTPWM->CCEN = tmpccen;
}

/**
*\*\name    TIM_ConfigOc2Polarity
*\*\fun     Configures the TIM_OUTPWM channel 2 polarity.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   TIM_OCPreload
*\*\          - TIM_OC_POLARITY_HIGH
*\*\          - TIM_OC_POLARITY_LOW
*\*\return  none
**/
void TIM_ConfigOc2Polarity(TIM_Module* TIM_OUTPWM, uint32_t OcPolarity)
{
    uint32_t tmpccen ;
    tmpccen = TIM_OUTPWM->CCEN;
    /* Set or Reset the CC2P Bit */
    tmpccen &= (uint32_t)(~((uint32_t)TIM_CCEN_CC2P));
    tmpccen |= (uint32_t)(OcPolarity << 4);
    /* Write to TIM_OUTPWM CCEN register */
    TIM_OUTPWM->CCEN = tmpccen;
}

/**
*\*\name    TIM_ConfigOc2NPolarity
*\*\fun     Configures the TIM_OUTPWM channel 2N polarity.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   TIM_OCPreload
*\*\          - TIM_OCN_POLARITY_HIGH
*\*\          - TIM_OCN_POLARITY_LOW
*\*\return  none
**/
void TIM_ConfigOc2NPolarity(TIM_Module* TIM_OUTPWM, uint32_t OcNPolarity)
{
    uint32_t tmpccen ;
    tmpccen = TIM_OUTPWM->CCEN;
    /* Set or Reset the CC2NP Bit */
    tmpccen &= (uint32_t)(~((uint32_t)TIM_CCEN_CC2NP));
    tmpccen |= (uint32_t)(OcNPolarity << 4);
    /* Write to TIM_OUTPWM CCEN register */
    TIM_OUTPWM->CCEN = tmpccen;
}

/**
*\*\name    TIM_ConfigOc3Polarity
*\*\fun     Configures the TIM_OUTPWM channel 3 polarity.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   TIM_OCPreload
*\*\          - TIM_OC_POLARITY_HIGH
*\*\          - TIM_OC_POLARITY_LOW
*\*\return  none
**/
void TIM_ConfigOc3Polarity(TIM_Module* TIM_OUTPWM, uint32_t OcPolarity)
{
    uint32_t tmpccen ;
    tmpccen = TIM_OUTPWM->CCEN;
    /* Set or Reset the CC3P Bit */
    tmpccen &= (uint32_t)(~((uint32_t)TIM_CCEN_CC3P));
    tmpccen |= (uint32_t)(OcPolarity << 8);
    /* Write to TIM_OUTPWM CCEN register */
    TIM_OUTPWM->CCEN = tmpccen;
}

/**
*\*\name    TIM_ConfigOc3NPolarity
*\*\fun     Configures the TIM_OUTPWM channel 3N polarity.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   TIM_OCPreload
*\*\          - TIM_OCN_POLARITY_HIGH
*\*\          - TIM_OCN_POLARITY_LOW
*\*\return  none
**/
void TIM_ConfigOc3NPolarity(TIM_Module* TIM_OUTPWM, uint32_t OcNPolarity)
{
    uint32_t tmpccen ;
    tmpccen = TIM_OUTPWM->CCEN;
    /* Set or Reset the CC3NP Bit */
    tmpccen &= (uint32_t)(~((uint32_t)TIM_CCEN_CC3NP));
    tmpccen |= (uint32_t)(OcNPolarity << 8);
    /* Write to TIM_OUTPWM CCEN register */
    TIM_OUTPWM->CCEN = tmpccen;
}

/**
*\*\name    TIM_ConfigOc4Polarity
*\*\fun     Configures the TIM_OUTPWM channel 4 polarity.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\param   TIM_OCPreload
*\*\          - TIM_OC_POLARITY_HIGH
*\*\          - TIM_OC_POLARITY_LOW
*\*\return  none
**/
void TIM_ConfigOc4Polarity(TIM_Module* TIM_OUTPWM, uint32_t OcPolarity)
{
    uint32_t tmpccen ;
    tmpccen = TIM_OUTPWM->CCEN;
    /* Set or Reset the CC4P Bit */
    tmpccen &= (uint32_t)(~((uint32_t)TIM_CCEN_CC4P));
    tmpccen |= (uint32_t)(OcPolarity << 12);
    /* Write to TIM_OUTPWM CCEN register */
    TIM_OUTPWM->CCEN = tmpccen;
}

/**
*\*\name    TIM_ConfigOc4NPolarity
*\*\fun     Configures the TIM_OUTPWM channel 4N polarity.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   TIM_OCPreload
*\*\          - TIM_OCN_POLARITY_HIGH
*\*\          - TIM_OCN_POLARITY_LOW
*\*\return  none
**/
void TIM_ConfigOc4NPolarity(TIM_Module* TIM_OUTPWM, uint32_t OcNPolarity)
{
    uint32_t tmpccen ;
    tmpccen = TIM_OUTPWM->CCEN;
    /* Set or Reset the CC3NP Bit */
    tmpccen &= (uint32_t)(~((uint32_t)TIM_CCEN_CC4NP));
    tmpccen |= (uint32_t)(OcNPolarity << 12);
    /* Write to TIM_OUTPWM CCEN register */
    TIM_OUTPWM->CCEN = tmpccen;
}

/**
*\*\name    TIM_ConfigOc5Polarity
*\*\fun     Configures the TIM_OUTPWM channel 5 polarity.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   TIM_OCPreload
*\*\          - TIM_OC_POLARITY_HIGH
*\*\          - TIM_OC_POLARITY_LOW
*\*\return  none
**/
void TIM_ConfigOc5Polarity(TIM_Module* TIM_OUTPWM, uint32_t OcPolarity)
{
    uint32_t tmpccen;
    tmpccen = TIM_OUTPWM->CCEN;
    /* Set or Reset the CC5P Bit */
    tmpccen &= (uint32_t)(~((uint32_t)TIM_CCEN_CC5P));
    tmpccen |= (uint32_t)(OcPolarity << 16);
    /* Write to TIM_OUTPWM CCEN register */
    TIM_OUTPWM->CCEN = tmpccen;
}

/**
*\*\name    TIM_ConfigOc6Polarity
*\*\fun     Configures the TIM_OUTPWM channel 6 polarity.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   TIM_OCPreload
*\*\          - TIM_OC_POLARITY_HIGH
*\*\          - TIM_OC_POLARITY_LOW
*\*\return  none
**/
void TIM_ConfigOc6Polarity(TIM_Module* TIM_OUTPWM, uint32_t OcPolarity)
{
    uint32_t tmpccen ;
    tmpccen = TIM_OUTPWM->CCEN;
    /* Set or Reset the CC6P Bit */
    tmpccen &= (uint32_t)(~((uint32_t)TIM_CCEN_CC6P));
    tmpccen |= (uint32_t)(OcPolarity << 20);
    /* Write to TIM_OUTPWM CCEN register */
    TIM_OUTPWM->CCEN = tmpccen;
}

/**
*\*\name    TIM_ConfigOc7Polarity
*\*\fun     Configures the TIM_OUTPWM channel 7 polarity.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   TIM_OCPreload
*\*\          - TIM_OC_POLARITY_HIGH
*\*\          - TIM_OC_POLARITY_LOW
*\*\return  none
**/
void TIM_ConfigOc7Polarity(TIM_Module* TIM_OUTPWM, uint32_t OcPolarity)
{
    uint32_t tmpccen ;
    tmpccen = TIM_OUTPWM->CCEN;
    /* Set or Reset the CC6P Bit */
    tmpccen &= (uint32_t)(~((uint32_t)TIM_CCEN_CC7P));
    tmpccen |= (uint32_t)(OcPolarity << 22);
    /* Write to TIM_OUTPWM CCEN register */
    TIM_OUTPWM->CCEN = tmpccen;
}

/**
*\*\name    TIM_EnableCapCmpCh
*\*\fun     Enables or disables the TIM Capture Compare Channel x.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   Channel
*\*\          - TIM_CH_1
*\*\          - TIM_CH_2
*\*\          - TIM_CH_3
*\*\          - TIM_CH_4
*\*\          - TIM_CH_5
*\*\          - TIM_CH_6
*\*\          - TIM_CH_7
*\*\param   TIM_CCx
*\*\          - TIM_CAP_CMP_ENABLE
*\*\          - TIM_CAP_CMP_DISABLE
*\*\return  none
**/
void TIM_EnableCapCmpCh(TIM_Module* TIM_OUTPWM, uint32_t Channel, uint32_t TIM_CCx)
{
    uint32_t tmp ;
    tmp = CAPCMPEN_CCE_SET << Channel;
    /* Reset the CCxEN Bit */
    TIM_OUTPWM->CCEN &= (uint32_t)(~tmp);
    /* Set or reset the CCxEN Bit */
    TIM_OUTPWM->CCEN |= (uint32_t)(TIM_CCx << Channel);
}

/**
*\*\name    TIM_EnableCapCmpChN
*\*\fun     Enables or disables the TIM Capture Compare Channel xN.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   Channel
*\*\          - TIM_CH_1
*\*\          - TIM_CH_2
*\*\          - TIM_CH_3
*\*\          - TIM_CH_4
*\*\param   TIM_CCx
*\*\          - TIM_CAP_CMP_N_ENABLE
*\*\          - TIM_CAP_CMP_N_DISABLE
*\*\return  none
**/
void TIM_EnableCapCmpChN(TIM_Module* TIM_OUTPWM, uint32_t Channel, uint32_t TIM_CCxN)
{
    uint32_t tmp ;
    tmp = CAPCMPEN_CCNE_SET << Channel;
    /* Reset the CCxNEN Bit */
    TIM_OUTPWM->CCEN &= (uint32_t)(~tmp);
    /* Set or reset the CCxNEN Bit */
    TIM_OUTPWM->CCEN |= (uint32_t)(TIM_CCxN << Channel);
}

/**
*\*\name    TIM_SelectOcMode
*\*\fun     Selects the TIM Output Compare Mode.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   Channel
*\*\          - TIM_CH_1
*\*\          - TIM_CH_2
*\*\          - TIM_CH_3
*\*\          - TIM_CH_4
*\*\          - TIM_CH_5
*\*\          - TIM_CH_6
*\*\          - TIM_CH_7
*\*\param   OcMode
*\*\          - TIM_OCMODE_TIMING
*\*\          - TIM_OCMODE_ACTIVE
*\*\          - TIM_OCMODE_INACTIVE
*\*\          - TIM_OCMODE_TOGGLE
*\*\          - TIM_OCMODE_PWM1
*\*\          - TIM_OCMODE_PWM2
*\*\          - TIM_FORCED_ACTION_ACTIVE
*\*\          - TIM_FORCED_ACTION_INACTIVE
*\*\return  none
**/
void TIM_SelectOcMode(TIM_Module* TIM_OUTPWM, uint32_t Channel, uint32_t OcMode)
{
    uint32_t tmp  ;
    uint32_t tmp1 ;

    tmp = (uint32_t)TIM_OUTPWM;
    tmp += CAPCMPMOD_OFFSET;

