2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_tim.c
    tmp1 = CAPCMPEN_CCE_SET << Channel;

    /* Disable the Channel: Reset the CCxE Bit */
    TIM_OUTPWM->CCEN &= (uint32_t)(~tmp1);

    if ((Channel == TIM_CH_1) || (Channel == TIM_CH_3) || (Channel == TIM_CH_5))
    {
        tmp += (uint32_t)(Channel >> 1);

        /* Reset the OCxMD bits in the CCMRx register */
        *(__IO uint32_t*)tmp &= (uint32_t) (~TIM_CCMOD1_OC1MD);

        /* Configure the OCxMD bits in the CCMRx register */
        *(__IO uint32_t*)tmp |= (uint32_t)OcMode;
    }
    else if (Channel == TIM_CH_7)
    {
        tmp += (uint32_t)0x08;

        /* Reset the OCxMD bits in the CCMRx register */
        *(__IO uint32_t*)tmp &= (uint32_t) (~TIM_CCMOD3_OC7MD);

        /* Configure the OCxMD bits in the CCMRx register */
        *(__IO uint32_t*)tmp |= (uint32_t)(OcMode<<20);
    }
    else if ((Channel == TIM_CH_2) || (Channel == TIM_CH_4) || (Channel == TIM_CH_6))
    {
        tmp += (uint32_t)((Channel - 4) >> 1);

        /* Reset the OCxMD bits in the CCMRx register */
        *(__IO uint32_t*)tmp &= (uint32_t)(~TIM_CCMOD1_OC2MD);

        /* Configure the OCxMD bits in the CCMRx register */
        *(__IO uint32_t*)tmp |= (uint32_t)(OcMode << 8);
    }
    else
    {
    
    }
}

/**
*\*\name    TIM_EnableUpdateEvt
*\*\fun     Enables or Disables the TIM_OUTPWM Update event.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\param   Cmd
*\*\          - ENABLE
*\*\          - DISABLE
*\*\return  none
**/
void TIM_EnableUpdateEvt(TIM_Module* TIM_OUTPWM, FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Set the Update Disable Bit */
        TIM_OUTPWM->CTRL1 |= (uint32_t)TIM_CTRL1_UPDIS;
    }
    else
    {
        /* Reset the Update Disable Bit */
        TIM_OUTPWM->CTRL1 &= (uint32_t)(~((uint32_t)TIM_CTRL1_UPDIS));
    }
}

/**
*\*\name    TIM_ConfigUpdateEvt
*\*\fun     Enables or Disables the TIM_OUTPWM Update event.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\param   Cmd
*\*\          - ENABLE
*\*\          - DISABLE
*\*\return  none
**/
void TIM_ConfigUpdateEvt(TIM_Module* TIM_OUTPWM, FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Reset the Update Disable Bit,enable UEV */
        TIM_OUTPWM->CTRL1 &= (uint32_t)(~((uint32_t)TIM_CTRL1_UPDIS));
    }
    else
    {
        /* Set the Update Disable Bit,disable UEV */
        TIM_OUTPWM->CTRL1 |= (uint32_t)TIM_CTRL1_UPDIS;
    }
}

/**
*\*\name    TIM_ConfigUpdateRequestIntSrc
*\*\fun     Configures the TIM_OUTPWM Update Request Interrupt source.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\param   TIM_UpdateSource
*\*\          - TIM_UPDATE_SRC_GLOBAL
*\*\          - TIM_UPDATE_SRC_REGULAR
*\*\return  none
**/
void TIM_ConfigUpdateRequestIntSrc(TIM_Module* TIM_OUTPWM, uint32_t TIM_UpdateSource)
{
    if (TIM_UpdateSource != TIM_UPDATE_SRC_GLOBAL)
    {
        /* Set the UPRS Bit */
        TIM_OUTPWM->CTRL1 |= (uint32_t)TIM_CTRL1_UPRS;
    }
    else
    {
        /* Reset the UPRS Bit */
        TIM_OUTPWM->CTRL1 &= (uint32_t)(~((uint32_t)TIM_CTRL1_UPRS));
    }
}

/**
*\*\name    TIM_SelectHallSensor
*\*\fun     Enables or disables the TIM_OUTPWM's Hall sensor interface.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   Cmd
*\*\          - ENABLE
*\*\          - DISABLE
*\*\return  none
**/
void TIM_SelectHallSensor(TIM_Module* TIM_OUTPWM, FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Set the TI1SEL Bit */
        TIM_OUTPWM->CTRL2 |= (uint32_t)TIM_CTRL2_TI1SEL;
    }
    else
    {
        /* Reset the TI1SEL Bit */
        TIM_OUTPWM->CTRL2 &= (uint32_t)(~((uint32_t)TIM_CTRL2_TI1SEL));
    }
}

/**
*\*\name    TIM_SelectOnePulseMode
*\*\fun     Selects the TIM_OUTPWM's One Pulse Mode.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\param   TIM_OPMode
*\*\          - TIM_OPMODE_SINGLE
*\*\          - TIM_OPMODE_REPET
*\*\return  none
**/
void TIM_SelectOnePulseMode(TIM_Module* TIM_OUTPWM, uint32_t TIM_OPMode)
{
    /* Reset the ONEPM Bit */
    TIM_OUTPWM->CTRL1 &= (uint32_t)(~((uint32_t)TIM_CTRL1_ONEPM));
    /* Configure the ONEPM Mode */
    TIM_OUTPWM->CTRL1 |= (uint32_t)TIM_OPMode;
}

/**
*\*\name    TIM_SelectOutputTrig
*\*\fun     Selects the TIM_OUTPWM Trigger Output Mode.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   TIM_TRGOSource
*\*\          - TIM_TRGO_SRC_RESET
*\*\          - TIM_TRGO_SRC_ENABLE
*\*\          - TIM_TRGO_SRC_UPDATE
*\*\          - TIM_TRGO_SRC_OC1
*\*\          - TIM_TRGO_SRC_OC1REF
*\*\          - TIM_TRGO_SRC_OC2REF
*\*\          - TIM_TRGO_SRC_OC3REF
*\*\          - TIM_TRGO_SRC_OC4REF
*\*\          - TIM_TRGO_SRC_OC5REF
*\*\          - TIM_TRGO_SRC_OC6REF
*\*\          - TIM_TRGO_SRC_OC7REF
*\*\return  none
**/
void TIM_SelectOutputTrig(TIM_Module* TIM_OUTPWM, uint32_t TIM_TRGOSource)
{
    /* Reset the MMSEL Bits */
    TIM_OUTPWM->CTRL2 &= (uint32_t)(~((uint32_t)TIM_CTRL2_MMSEL));
    /* Select the TRGO source */
    TIM_OUTPWM->CTRL2 |= TIM_TRGOSource;
}

/**
*\*\name    TIM_SelectSlaveMode
*\*\fun     Selects the TIM_OUTPWM Slave Mode.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   TIM_SlaveMode
*\*\          - TIM_SLAVE_MODE_DISABLE
*\*\          - TIM_SLAVE_MODE_RESET
*\*\          - TIM_SLAVE_MODE_GATED
*\*\          - TIM_SLAVE_MODE_TRIG
*\*\          - TIM_SLAVE_MODE_EXT1
*\*\          - TIM_SLAVE_MODE_GATED_RESET
*\*\          - TIM_SLAVE_MODE_TRIG_RESET
*\*\return  none
**/
void TIM_SelectSlaveMode(TIM_Module* TIM_OUTPWM, uint32_t TIM_SlaveMode)
{
    /* Reset the SMSEL Bits */
    TIM_OUTPWM->SMCTRL &= (uint32_t)(~((uint32_t)TIM_SMCTRL_SMSEL));
    /* Select the Slave Mode */
    TIM_OUTPWM->SMCTRL |= (uint32_t)TIM_SlaveMode;
}

/**
*\*\name    TIM_SelectMasterSlaveMode
*\*\fun     Sets or Resets the TIM_OUTPWM Master/Slave Mode.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   TIM_SlaveMode
*\*\          - TIM_MASTER_SLAVE_MODE_ENABLE
*\*\          - TIM_MASTER_SLAVE_MODE_DISABLE
*\*\return  none
**/
void TIM_SelectMasterSlaveMode(TIM_Module* TIM_OUTPWM, uint32_t TIM_MasterSlaveMode)
{
    /* Reset the MSMD Bit */
    TIM_OUTPWM->SMCTRL &= (uint32_t)(~((uint32_t)TIM_SMCTRL_MSMD));
    /* Set or Reset the MSMD Bit */
    TIM_OUTPWM->SMCTRL |= (uint32_t)TIM_MasterSlaveMode;
}

/**
*\*\name    TIM_SetCnt
*\*\fun     Sets the TIM_OUTPWM Counter Register value
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\param   Counter
*\*\          - Counter can be a number between 0x00000000 and 0xFFFFFFFF
*\*\return  none
**/
void TIM_SetCnt(TIM_Module* TIM_OUTPWM, uint32_t Counter)
{
    /* Set the Counter Register value */
    TIM_OUTPWM->CNT = (uint32_t)Counter;
}

/**
*\*\name    TIM_SetAutoReload
*\*\fun     Sets the TIM_OUTPWM Autoreload Register value
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\param   Autoreload
*\*\          - Autoreload can be a number between 0x00000000 and 0xFFFFFFFF
*\*\return  none
**/
void TIM_SetAutoReload(TIM_Module* TIM_OUTPWM, uint32_t Autoreload)
{
    /* Set the Autoreload Register value */
    TIM_OUTPWM->AR = (uint32_t)Autoreload;
}

/**
*\*\name    TIM_SetCmp1
*\*\fun     Sets the TIM_OUTPWM Capture Compare1 Register value
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   Compare1
*\*\          - Compare1 can be a number between 0x00000000 and 0xFFFFFFFF
*\*\return  none
**/
void TIM_SetCmp1(TIM_Module* TIM_OUTPWM, uint32_t Compare1)
{
    uint32_t tmpccdatx ;
    tmpccdatx = TIM_OUTPWM->CCDAT1 ;
    if((TIM_OUTPWM==TIM1) || (TIM_OUTPWM==TIM3))
    {
        /* Reset the Capture Compare1 Register value */ 
        tmpccdatx &= (uint32_t)(~TIM_CCDAT1_CCDAT1);
        tmpccdatx |= (uint32_t)Compare1; 
    }
    else
    {
        /* Reset the Capture Compare1 Register value */ 
        tmpccdatx &= (uint32_t)(~TIM_CCDAT1);
        tmpccdatx |= (uint32_t)Compare1;       
    }
    /* Set the Capture Compare1 Register value */
    TIM_OUTPWM->CCDAT1 = tmpccdatx;
}

/**
*\*\name    TIM_SetCmp2
*\*\fun     Sets the TIM_OUTPWM Capture Compare2 Register value
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   Compare2
*\*\          - Compare2 can be a number between 0x00000000 and 0xFFFFFFFF
*\*\return  none
**/
void TIM_SetCmp2(TIM_Module* TIM_OUTPWM, uint32_t Compare2)
{
    uint32_t tmpccdatx ;
    tmpccdatx = TIM_OUTPWM->CCDAT2 ;
    if((TIM_OUTPWM==TIM1) || (TIM_OUTPWM==TIM3))
    {
        /* Reset the Capture Compare2 Register value */ 
        tmpccdatx &= (uint32_t)(~TIM_CCDAT2_CCDAT2);
        tmpccdatx |= (uint32_t)Compare2; 
    }
    else
    {
        /* Reset the Capture Compare2 Register value */ 
        tmpccdatx &= (uint32_t)(~TIM_CCDAT2);
        tmpccdatx |= (uint32_t)Compare2;       
    }
    /* Set the Capture Compare2 Register value */
    TIM_OUTPWM->CCDAT2 = tmpccdatx;    
}

/**
*\*\name    TIM_SetCmp3
*\*\fun     Sets the TIM_OUTPWM Capture Compare3 Register value
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   Compare3
*\*\          - Compare3 can be a number between 0x00000000 and 0xFFFFFFFF
*\*\return  none
**/
void TIM_SetCmp3(TIM_Module* TIM_OUTPWM, uint32_t Compare3)
{
    uint32_t tmpccdatx ;
    tmpccdatx = TIM_OUTPWM->CCDAT3 ;
    if((TIM_OUTPWM==TIM1) || (TIM_OUTPWM==TIM3))
    {
        /* Reset the Capture Compare3 Register value */ 
        tmpccdatx &= (uint32_t)(~TIM_CCDAT3_CCDAT3);
        tmpccdatx |= (uint32_t)Compare3; 
    }
    else
    {
        /* Reset the Capture Compare3 Register value */ 
        tmpccdatx &= (uint32_t)(~TIM_CCDAT3);
        tmpccdatx |= (uint32_t)Compare3;       
    }
    /* Set the Capture Compare3 Register value */
    TIM_OUTPWM->CCDAT3 = tmpccdatx;   
}

/**
*\*\name    TIM_SetCmp4
*\*\fun     Sets the TIM_OUTPWM Capture Compare4 Register value
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\param   Compare4
*\*\          - Compare4 can be a number between 0x0000 and 0xFFFF
*\*\return  none
**/
void TIM_SetCmp4(TIM_Module* TIM_OUTPWM, uint16_t Compare4)
{
    uint32_t tmpccdatx ;
    tmpccdatx = TIM_OUTPWM->CCDAT4 ;
    /* Reset the Capture Compare4 Register value */ 
    tmpccdatx &= (uint32_t)(~TIM_CCDAT4_CCDAT4);
    tmpccdatx |= (uint32_t)Compare4;
    /* Set the Capture Compare4 Register value */
    TIM_OUTPWM->CCDAT4 = tmpccdatx;   
}

/**
*\*\name    TIM_SetCmp5
*\*\fun     Sets the TIM_OUTPWM Capture Compare5 Register value
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   Compare5
*\*\          - Compare5 can be a number between 0x0000 and 0xFFFF
*\*\return  none
**/
void TIM_SetCmp5(TIM_Module* TIM_OUTPWM, uint16_t Compare5)
{
    /* Set the Capture Compare5 Register value */
    TIM_OUTPWM->CCDAT5 = (uint32_t)Compare5;
}

/**
*\*\name    TIM_SetCmp6
*\*\fun     Sets the TIM_OUTPWM Capture Compare6 Register value
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   Compare6
*\*\          - Compare6 can be a number between 0x0000 and 0xFFFF
*\*\return  none
**/
void TIM_SetCmp6(TIM_Module* TIM_OUTPWM, uint16_t Compare6)
{
    /* Set the Capture Compare6 Register value */
    TIM_OUTPWM->CCDAT6 = (uint32_t)Compare6;
}

/**
*\*\name    TIM_SetCmp7
*\*\fun     Sets the TIM_OUTPWM Capture Compare7 Register value
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   Compare7
*\*\          - Compare7 can be a number between 0x0000 and 0xFFFF
*\*\return  none
**/
void TIM_SetCmp7(TIM_Module* TIM_OUTPWM, uint16_t Compare7)
{
    /* Set the Capture Compare7 Register value */
    TIM_OUTPWM->CCDAT7 = (uint32_t)Compare7;
}



/**
*\*\name    TIM_SetCmp1D
*\*\fun     Sets the CCDDAT1[16:31] in TIM1_CCDAT1 register
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   compare1D
*\*\          - compare1D can be a number between 0x0000 and 0xFFFF
*\*\return  none
**/
void TIM_SetCmp1D(TIM_Module* TIM_OUTPWM, uint16_t compare1D)
{
    uint32_t tmpccdatx ;
    tmpccdatx = TIM_OUTPWM->CCDAT1 ;
    /* Reset the Capture compare1D Register value */ 
    tmpccdatx &= (uint32_t)(~TIM_CCDAT1_CCDDAT1);
    tmpccdatx |= (uint32_t)(((uint32_t)compare1D) << 0x00000010);
    /* Set the Capture compare1D Register value */
    TIM_OUTPWM->CCDAT1 = tmpccdatx;
}

/**
*\*\name    TIM_SetCmp2D
*\*\fun     Sets the CCDDAT2[16:31] in TIM1_CCDAT2 register
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   compare2D
*\*\          - compare2D can be a number between 0x0000 and 0xFFFF
*\*\return  none
**/
void TIM_SetCmp2D(TIM_Module* TIM_OUTPWM, uint16_t compare2D)
{
    uint32_t tmpccdatx ;
    tmpccdatx = TIM_OUTPWM->CCDAT2 ;
    /* Reset the Capture compare2D Register value */ 
    tmpccdatx &= (uint32_t)(~TIM_CCDAT2_CCDDAT2);
    tmpccdatx |= (uint32_t)(((uint32_t)compare2D) << 0x00000010);
    /* Set the Capture compare2D Register value */
    TIM_OUTPWM->CCDAT2 = tmpccdatx;
}

/**
*\*\name    TIM_SetCmp3D
*\*\fun     Sets the CCDDAT3[16:31] in TIM1_CCDAT3 register
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   compare3D
*\*\          - compare3D can be a number between 0x0000 and 0xFFFF
*\*\return  none
**/
void TIM_SetCmp3D(TIM_Module* TIM_OUTPWM, uint16_t compare3D)
{
    uint32_t tmpccdatx ;
    tmpccdatx = TIM_OUTPWM->CCDAT3 ;
    /* Reset the Capture compare3D Register value */ 
    tmpccdatx &= (uint32_t)(~TIM_CCDAT3_CCDDAT3);
    tmpccdatx |= (uint32_t)(((uint32_t)compare3D) << 0x00000010);
    /* Set the Capture compare3D Register value */
    TIM_OUTPWM->CCDAT3 = tmpccdatx;
}

/**
*\*\name    TIM_SetCmp4D
*\*\fun     Sets the CCDDAT4[16:31] in TIM1_CCDAT4 register
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   compare4D
*\*\          - compare4D can be a number between 0x0000 and 0xFFFF
*\*\return  none
**/
void TIM_SetCmp4D(TIM_Module* TIM_OUTPWM, uint16_t compare4D)
{
    uint32_t tmpccdatx ;
    tmpccdatx = TIM_OUTPWM->CCDAT4 ;
    /* Reset the Capture compare4D Register value */ 
    tmpccdatx &= (uint32_t)(~TIM_CCDAT4_CCDDAT4);
    tmpccdatx |= (uint32_t)(((uint32_t)compare4D) << 0x00000010);
    /* Set the Capture compare4D Register value */
    TIM_OUTPWM->CCDAT4 = tmpccdatx;
}

/**
*\*\name    ConfigTI1
*\*\fun     Configure the TI1 as Input.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   ICPolarity
*\*\          - TIM_IC_POLARITY_RISING
*\*\          - TIM_IC_POLARITY_FALLING
*\*\param   ICSelection
*\*\          - TIM_IC_SELECTION_DIRECTTI
*\*\          - TIM_IC_SELECTION_INDIRECTTI
*\*\          - TIM_IC_SELECTION_TRC
*\*\param   ICFilter
*\*\          - ICFilter can be a number between 0x0 and 0xF
*\*\return  none
**/
void ConfigTI1(TIM_Module* TIM_OUTPWM, uint32_t ICPolarity, uint32_t ICSelection, uint32_t ICFilter)
{
    uint32_t tmpccmodx ;
    uint32_t tmpccen  ;
    
