2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_tim.c
    /* Disable the Channel 1: Reset the CC1E Bit */
    TIM_OUTPWM->CCEN &= (uint32_t)(~((uint32_t)TIM_CCEN_CC1EN));    

    /* Get the TIMx_CCMOD1 and TIMx_CCEN register value */    
    tmpccmodx = TIM_OUTPWM->CCMOD1;
    tmpccen  = TIM_OUTPWM->CCEN;    
    
    /* Select the Input and set the filter */
    tmpccmodx &= (uint32_t)(((uint32_t) ~((uint32_t)TIM_CCMOD1_CC1SEL)) & ((uint32_t) ~((uint32_t)TIM_CCMOD1_IC1F)));
    tmpccmodx |= (uint32_t)(ICSelection | (uint32_t)(ICFilter << (uint32_t)4));
    
    /* Select the Polarity and set the CC1E Bit */
    tmpccen &= (uint32_t)(~((uint32_t)(TIM_CCEN_CC1P)));
    tmpccen |= (uint32_t)(ICPolarity | (uint32_t)TIM_CCEN_CC1EN);   
    
    /* Write to TIM_OUTPWM CCMOD1 and CCEN registers */
    TIM_OUTPWM->CCMOD1 = tmpccmodx;
    TIM_OUTPWM->CCEN   = tmpccen;    
}

/**
*\*\name    ConfigTI2
*\*\fun     Configure the TI2 as Input.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   ICPolarity
*\*\          - TIM_IC_POLARITY_RISING
*\*\          - TIM_IC_POLARITY_FALLING
*\*\param   ICSelection
*\*\          - TIM_IC_SELECTION_DIRECTTI
*\*\          - TIM_IC_SELECTION_INDIRECTTI
*\*\          - TIM_IC_SELECTION_TRC
*\*\param   ICFilter
*\*\          - ICFilter can be a number between 0x0 and 0xF
*\*\return  none
**/
void ConfigTI2(TIM_Module* TIM_OUTPWM, uint32_t ICPolarity, uint32_t ICSelection, uint32_t ICFilter)
{
    uint32_t tmpccmodx ;
    uint32_t tmpccen , tmp ;
    
    /* Disable the Channel 2: Reset the CC2E Bit */
    TIM_OUTPWM->CCEN &= (uint32_t)(~((uint32_t)TIM_CCEN_CC2EN));
    
    /* Get the TIMx_CCMOD1 and TIMx_CCEN register value */       
    tmpccmodx = TIM_OUTPWM->CCMOD1;
    tmpccen  = TIM_OUTPWM->CCEN;
    
    tmp      = (uint32_t)(ICPolarity << 4);
    
    /* Select the Input and set the filter */
    tmpccmodx &= (uint32_t)(((uint32_t) ~((uint32_t)TIM_CCMOD1_CC2SEL)) & ((uint32_t) ~((uint32_t)TIM_CCMOD1_IC2F)));
    tmpccmodx |= (uint32_t)(ICFilter << 12);
    tmpccmodx |= (uint32_t)(ICSelection << 8);

    /* Select the Polarity and set the CC2E Bit */
    tmpccen &= (uint32_t)(~((uint32_t)(TIM_CCEN_CC2P)));
    tmpccen |= (uint32_t)(tmp | (uint32_t)TIM_CCEN_CC2EN);

    /* Write to TIM_OUTPWM CCMOD1 and CCEN registers */
    TIM_OUTPWM->CCMOD1 = tmpccmodx;
    TIM_OUTPWM->CCEN   = tmpccen;
}

/**
*\*\name    ConfigTI3
*\*\fun     Configure the TI3 as Input.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   ICPolarity
*\*\          - TIM_IC_POLARITY_RISING
*\*\          - TIM_IC_POLARITY_FALLING
*\*\param   ICSelection
*\*\          - TIM_IC_SELECTION_DIRECTTI
*\*\          - TIM_IC_SELECTION_INDIRECTTI
*\*\          - TIM_IC_SELECTION_TRC
*\*\param   ICFilter
*\*\          - ICFilter can be a number between 0x0 and 0xF
*\*\return  none
**/
void ConfigTI3(TIM_Module* TIM_OUTPWM, uint32_t ICPolarity, uint32_t ICSelection, uint32_t ICFilter)
{
    uint32_t tmpccmodx ;
    uint32_t tmpccen , tmp ;
    
    /* Disable the Channel 3: Reset the CC3E Bit */
    TIM_OUTPWM->CCEN &= (uint32_t)(~((uint32_t)TIM_CCEN_CC3EN));

    /* Get the TIMx_CCMOD2 and TIMx_CCEN register value */       
    tmpccmodx = TIM_OUTPWM->CCMOD2;
    tmpccen  = TIM_OUTPWM->CCEN;
    
    tmp      = (uint32_t)(ICPolarity << 8);
    
    /* Select the Input and set the filter */
    tmpccmodx &= (uint32_t)(((uint32_t) ~((uint32_t)TIM_CCMOD2_CC3SEL)) & ((uint32_t) ~((uint32_t)TIM_CCMOD2_IC3F)));
    tmpccmodx |= (uint32_t)(ICSelection | (uint32_t)(ICFilter << (uint32_t)4));

    /* Select the Polarity and set the CC3E Bit */
    tmpccen &= (uint32_t)(~((uint32_t)(TIM_CCEN_CC3P)));
    tmpccen |= (uint32_t)(tmp | (uint32_t)TIM_CCEN_CC3EN);

    /* Write to TIM_OUTPWM CCMOD2 and CCEN registers */
    TIM_OUTPWM->CCMOD2 = tmpccmodx;
    TIM_OUTPWM->CCEN   = tmpccen;
}

/**
*\*\name    ConfigTI4
*\*\fun     Configure the TI4 as Input.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\param   ICPolarity
*\*\          - TIM_IC_POLARITY_RISING
*\*\          - TIM_IC_POLARITY_FALLING
*\*\param   ICSelection
*\*\          - TIM_IC_SELECTION_DIRECTTI
*\*\          - TIM_IC_SELECTION_INDIRECTTI
*\*\          - TIM_IC_SELECTION_TRC
*\*\param   ICFilter
*\*\          - ICFilter can be a number between 0x0 and 0xF
*\*\return  none
**/
void ConfigTI4(TIM_Module* TIM_OUTPWM, uint32_t ICPolarity, uint32_t ICSelection, uint32_t ICFilter)
{
    uint32_t tmpccmodx ;
    uint32_t tmpccen , tmp ;

    /* Disable the Channel 4: Reset the CC4E Bit */
    TIM_OUTPWM->CCEN &= (uint32_t)(~((uint32_t)TIM_CCEN_CC4EN));

    /* Get the TIMx_CCMOD2 and TIMx_CCEN register value */        
    tmpccmodx = TIM_OUTPWM->CCMOD2;
    tmpccen  = TIM_OUTPWM->CCEN;
    
    tmp      = (uint32_t)(ICPolarity << 12);
    
    /* Select the Input and set the filter */
    tmpccmodx &= (uint32_t)((uint32_t)(~(uint32_t)TIM_CCMOD2_CC4SEL) & ((uint32_t) ~((uint32_t)TIM_CCMOD2_IC4F)));
    tmpccmodx |= (uint32_t)(ICSelection << 8);
    tmpccmodx |= (uint32_t)(ICFilter << 12);

    /* Select the Polarity and set the CC4E Bit */
    tmpccen &= (uint32_t)(~((uint32_t)(TIM_CCEN_CC4P)));
    tmpccen |= (uint32_t)(tmp | (uint32_t)TIM_CCEN_CC4EN);

    /* Write to TIM_OUTPWM CCMOD2 and CCEN registers */
    TIM_OUTPWM->CCMOD2 = tmpccmodx;
    TIM_OUTPWM->CCEN   = tmpccen;
}

/**
*\*\name    TIM_SetInCap1Prescaler
*\*\fun     Sets the TIM_OUTPWM Input Capture 1 prescaler.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   ICPrescaler
*\*\          - TIM_IC_PSC_DIV1
*\*\          - TIM_IC_PSC_DIV2
*\*\          - TIM_IC_PSC_DIV4
*\*\          - TIM_IC_PSC_DIV8
*\*\return  none
**/
void TIM_SetInCap1Prescaler(TIM_Module* TIM_OUTPWM, uint32_t ICPrescaler)
{
    /* Reset the IC1PSC Bits */
    TIM_OUTPWM->CCMOD1 &= (uint32_t)(~TIM_CCMOD1_IC1PSC);
    /* Set the IC1PSC value */
    TIM_OUTPWM->CCMOD1 |= (uint32_t)ICPrescaler;
}

/**
*\*\name    TIM_SetInCap2Prescaler
*\*\fun     Sets the TIM_OUTPWM Input Capture 2 prescaler.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   ICPrescaler
*\*\          - TIM_IC_PSC_DIV1
*\*\          - TIM_IC_PSC_DIV2
*\*\          - TIM_IC_PSC_DIV4
*\*\          - TIM_IC_PSC_DIV8
*\*\return  none
**/
void TIM_SetInCap2Prescaler(TIM_Module* TIM_OUTPWM, uint32_t ICPrescaler)
{
    /* Reset the IC2PSC Bits */
    TIM_OUTPWM->CCMOD1 &= (uint32_t)(~TIM_CCMOD1_IC2PSC);
    /* Set the IC2PSC value */
    TIM_OUTPWM->CCMOD1 |= (uint32_t)(ICPrescaler << 8);
}

/**
*\*\name    TIM_SetInCap3Prescaler
*\*\fun     Sets the TIM_OUTPWM Input Capture 3 prescaler.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   ICPrescaler
*\*\          - TIM_IC_PSC_DIV1
*\*\          - TIM_IC_PSC_DIV2
*\*\          - TIM_IC_PSC_DIV4
*\*\          - TIM_IC_PSC_DIV8
*\*\return  none
**/
void TIM_SetInCap3Prescaler(TIM_Module* TIM_OUTPWM, uint32_t ICPrescaler)
{
    /* Reset the IC3PSC Bits */
    TIM_OUTPWM->CCMOD2 &= (uint32_t)(~TIM_CCMOD2_IC3PSC);
    /* Set the IC3PSC value */
    TIM_OUTPWM->CCMOD2 |= (uint32_t)ICPrescaler;
}

/**
*\*\name    TIM_SetInCap4Prescaler
*\*\fun     Sets the TIM_OUTPWM Input Capture 4 prescaler.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\param   ICPrescaler
*\*\          - TIM_IC_PSC_DIV1
*\*\          - TIM_IC_PSC_DIV2
*\*\          - TIM_IC_PSC_DIV4
*\*\          - TIM_IC_PSC_DIV8
*\*\return  none
**/
void TIM_SetInCap4Prescaler(TIM_Module* TIM_OUTPWM, uint32_t ICPrescaler)
{
    /* Reset the IC4PSC Bits */
    TIM_OUTPWM->CCMOD2 &= (uint32_t)(~TIM_CCMOD2_IC4PSC);
    /* Set the IC4PSC value */
    TIM_OUTPWM->CCMOD2 |= (uint32_t)(ICPrescaler << 8);
}

/**
*\*\name    TIM_SelectInputTrig
*\*\fun     Selects the Input Trigger source
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   TIM_InputTriggerSource:
*\*\          - TIM_TRIG_SEL_IN_TR0
*\*\          - TIM_TRIG_SEL_IN_TR1
*\*\          - TIM_TRIG_SEL_IN_TR2
*\*\          - TIM_TRIG_SEL_IN_TR3
*\*\          - TIM_TRIG_SEL_TI1F_ED
*\*\          - TIM_TRIG_SEL_TI1FP1
*\*\          - TIM_TRIG_SEL_TI2FP2
*\*\          - TIM_TRIG_SEL_ETRF
*\*\return  none
**/
void TIM_SelectInputTrig(TIM_Module* TIM_OUTPWM, uint32_t TIM_InputTriggerSource)
{
    uint32_t tmpsmctrl ;  
    /* Get the TIM_OUTPWM SMCTRL register value */
    tmpsmctrl = TIM_OUTPWM->SMCTRL;  
    
    /* Reset the TS Bits */
    tmpsmctrl &= (uint32_t)(~((uint32_t)TIM_SMCTRL_TSEL)); 
    
    /* Set the Input Trigger source */
    tmpsmctrl |= (uint32_t)TIM_InputTriggerSource;
     
    /* Write to TIM_OUTPWM SMCTRL */
    TIM_OUTPWM->SMCTRL = tmpsmctrl;          
}

/**
*\*\name    TIM_ConfigExtTrig
*\*\fun     Configures the TIM_OUTPWM External Trigger (ETR).
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   TIM_ExtTRGPrescaler:
*\*\          - TIM_EXT_TRG_PSC_OFF
*\*\          - TIM_EXT_TRG_PSC_DIV2
*\*\          - TIM_EXT_TRG_PSC_DIV4
*\*\          - TIM_EXT_TRG_PSC_DIV8
*\*\param   TIM_ExtTRGPolarity
*\*\          - TIM_EXT_TRIG_POLARITY_INVERTED
*\*\          - TIM_EXT_TRIG_POLARITY_NONINVERTED
*\*\param   ExtTRGFilter
*\*\          - ExtTRGFilter can be a number between 0x0 and 0xF
*\*\return  none
**/
void TIM_ConfigExtTrig(TIM_Module* TIM_OUTPWM,uint32_t TIM_ExtTRGPrescaler,uint32_t TIM_ExtTRGPolarity,uint32_t ExtTRGFilter)
{
    uint32_t tmpsmctrl ;
    tmpsmctrl = TIM_OUTPWM->SMCTRL;
    /* Reset the ETR Bits */
    tmpsmctrl &= (uint32_t)(~(TIM_SMCTRL_EXTPS | TIM_SMCTRL_EXTP | TIM_SMCTRL_EXTF));
    /* Set the Prescaler, the Filter value and the Polarity */
    tmpsmctrl |= (uint32_t)(TIM_ExtTRGPrescaler |(TIM_ExtTRGPolarity | (ExtTRGFilter << (uint32_t)12)));
    /* Write to TIM_OUTPWM SMCTRL */
    TIM_OUTPWM->SMCTRL = tmpsmctrl;
}

/**
*\*\name    TIM_SetClkDiv
*\*\fun     Sets the TIM_OUTPWM Clock Division value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\param   TIM_CKD:
*\*\          - TIM_CLK_DIV1
*\*\          - TIM_CLK_DIV2
*\*\          - TIM_CLK_DIV4
*\*\return  none
**/
void TIM_SetClkDiv(TIM_Module* TIM_OUTPWM, uint32_t TIM_CKD)
{
    /* Reset the CKD Bits */
    TIM_OUTPWM->CTRL1 &= (uint32_t)(~TIM_CTRL1_CLKD);
    /* Set the CKD value */
    TIM_OUTPWM->CTRL1 |= (uint32_t)TIM_CKD;
}

/**
*\*\name    TIM_GetCap1
*\*\fun     Gets the TIM_OUTPWM Input Capture 1 value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\return  Capture Compare 1 Register value.
**/
uint32_t TIM_GetCap1(TIM_Module* TIM_OUTPWM)
{
    uint32_t tempvalue;
    
