2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_tim.c
    if((TIM_OUTPWM==TIM1)||(TIM_OUTPWM==TIM3))
    {
        /* Get the Capture 1 Register value */
        tempvalue = (uint32_t)((uint16_t)(TIM_OUTPWM->CCDAT1));
    }
    else
    {
        /* Get the Capture 1 Register value */
        tempvalue = (uint32_t)(TIM_OUTPWM->CCDAT1);
    }
    return tempvalue;
}

/**
*\*\name    TIM_GetCap2
*\*\fun     Gets the TIM_OUTPWM Input Capture 2 value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\return  Capture Compare 2 Register value.
**/
uint32_t TIM_GetCap2(TIM_Module* TIM_OUTPWM)
{
    uint32_t tempvalue;
    if((TIM_OUTPWM==TIM1)||(TIM_OUTPWM==TIM3))
    {
        /* Get the Capture 2 Register value */
        tempvalue = (uint32_t)((uint16_t)(TIM_OUTPWM->CCDAT2));
    }
    else
    {
        /* Get the Capture 2 Register value */
        tempvalue = (uint32_t)(TIM_OUTPWM->CCDAT2);
    }
    return tempvalue;
}

/**
*\*\name    TIM_GetCap3
*\*\fun     Gets the TIM_OUTPWM Input Capture 3 value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\return  Capture Compare 3 Register value.
**/
uint32_t TIM_GetCap3(TIM_Module* TIM_OUTPWM)
{
    uint32_t tempvalue;
    if((TIM_OUTPWM==TIM1)||(TIM_OUTPWM==TIM3))
    {
        /* Get the Capture 3 Register value */
        tempvalue = (uint32_t)((uint16_t)(TIM_OUTPWM->CCDAT3));
    }
    else
    {
        /* Get the Capture 3 Register value */
        tempvalue = (uint32_t)(TIM_OUTPWM->CCDAT3);
    }
    return tempvalue;
}

/**
*\*\name    TIM_GetCap4
*\*\fun     Gets the TIM_OUTPWM Input Capture 4 value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\return  Capture Compare 4 Register value.
**/
uint16_t TIM_GetCap4(TIM_Module* TIM_OUTPWM)
{
    /* Get the Capture 4 Register value */
    return (uint16_t)(TIM_OUTPWM->CCDAT4);
}

/**
*\*\name    TIM_GetCap5
*\*\fun     Gets the TIM_OUTPWM Input Capture 5 value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\return  Capture Compare 5 Register value.
**/
uint16_t TIM_GetCap5(TIM_Module* TIM_OUTPWM)
{
    /* Get the Capture 5 Register value */
    return (uint16_t)(TIM_OUTPWM->CCDAT5);
}


/**
*\*\name    TIM_GetCap6
*\*\fun     Gets the TIM_OUTPWM Input Capture 6 value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\return  Capture Compare 6 Register value.
**/
uint16_t TIM_GetCap6(TIM_Module* TIM_OUTPWM)
{
    /* Get the Capture 1 Register value */
    return (uint16_t)(TIM_OUTPWM->CCDAT6);
}

/**
*\*\name    TIM_GetCap7
*\*\fun     Gets the TIM_OUTPWM Input Capture 7 value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\return  Capture Compare 7 Register value.
**/
uint16_t TIM_GetCap7(TIM_Module* TIM_OUTPWM)
{
    /* Get the Capture 7 Register value */
    return (uint16_t)(TIM_OUTPWM->CCDAT7);
}

/**
*\*\name    TIM_GetCap1D
*\*\fun     Gets the TIM_OUTPWM Input Capture 1D value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\return  Capture Compare 1D Register value.
**/
uint16_t TIM_GetCap1D(TIM_Module* TIM_OUTPWM)
{
    /* Get the Capture 1D Register value */
    return (uint16_t)((TIM_OUTPWM->CCDAT1) >> 0x00000010);
}

/**
*\*\name    TIM_GetCap2D
*\*\fun     Gets the TIM_OUTPWM Input Capture 2D value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\return  Capture Compare 2D Register value.
**/
uint16_t TIM_GetCap2D(TIM_Module* TIM_OUTPWM)
{
    /* Get the Capture 2D Register value */
    return (uint16_t)((TIM_OUTPWM->CCDAT2) >> 0x00000010);
}

/**
*\*\name    TIM_GetCap3D
*\*\fun     Gets the TIM_OUTPWM Input Capture 3D value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\return  Capture Compare 3D Register value.
**/
uint16_t TIM_GetCap3D(TIM_Module* TIM_OUTPWM)
{
    /* Get the Capture 3D Register value */
    return (uint16_t)((TIM_OUTPWM->CCDAT3) >> 0x00000010);
}

/**
*\*\name    TIM_GetCap4D
*\*\fun     Gets the TIM_OUTPWM Input Capture 4D value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\return  Capture Compare 4D Register value.
**/
uint16_t TIM_GetCap4D(TIM_Module* TIM_OUTPWM)
{
    /* Get the Capture 4D Register value */
    return (uint16_t)((TIM_OUTPWM->CCDAT4) >> 0x00000010);
}

/**
*\*\name    TIM_GetCnt
*\*\fun     Gets the TIM_OUTPWM Counter value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\return  Counter Register value.
**/
uint32_t TIM_GetCnt(TIM_Module* TIM_OUTPWM)
{
    /* Get the Counter Register value */
    return (uint32_t)(TIM_OUTPWM->CNT);
}

/**
*\*\name    TIM_GetPrescaler
*\*\fun     Gets the TIM_OUTPWM Prescaler value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\return  Prescaler Register value.
**/
uint16_t TIM_GetPrescaler(TIM_Module* TIM_OUTPWM)
{
    /* Get the Prescaler Register value */
    return (uint16_t)(TIM_OUTPWM->PSC);
}

/**
*\*\name    TIM_GetAutoReload
*\*\fun     Gets the TIM_OUTPWM AR value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\return  AR Register value.
**/
uint32_t TIM_GetAutoReload(TIM_Module* TIM_OUTPWM)
{
    /* Get the Prescaler Register value */
    return (uint32_t)(TIM_OUTPWM->AR);
}

/**
*\*\name    TIM_GetCCENStatus
*\*\fun     Checks whether the specified TIM flag is set or not.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\param   TIM_CCEN :
*\*\          - TIM_CC1EN
*\*\          - TIM_CC1NEN
*\*\          - TIM_CC2EN
*\*\          - TIM_CC2NEN
*\*\          - TIM_CC3EN
*\*\          - TIM_CC3NEN
*\*\          - TIM_CC4EN
*\*\          - TIM_CC4NEN
*\*\          - TIM_CC5EN
*\*\          - TIM_CC6EN
*\*\          - TIM_CC7EN
*\*\return  The new state of TIM_FLAG (SET or RESET).
**/
FlagStatus TIM_GetCCENStatus(TIM_Module* TIM_OUTPWM, uint32_t TIM_CCEN)
{
    INTStatus bitstatus;
    
