2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_tim.c
    if ((TIM_OUTPWM->CCEN & TIM_CCEN) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    
    else
    {
        bitstatus = RESET;
    }
    
    return bitstatus;
}

/**
*\*\name    TIM_GetFlagStatus
*\*\fun     Checks whether the specified TIM flag is set or not.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\param   TIM_FLAG :
*\*\          - TIM_FLAG_CC1
*\*\          - TIM_FLAG_CC2
*\*\          - TIM_FLAG_CC3
*\*\          - TIM_FLAG_CC4
*\*\          - TIM_FLAG_CC5
*\*\          - TIM_FLAG_CC6
*\*\          - TIM_FLAG_CC7
*\*\          - TIM_FLAG_CC1OF
*\*\          - TIM_FLAG_CC2OF
*\*\          - TIM_FLAG_CC3OF
*\*\          - TIM_FLAG_CC4OF
*\*\          - TIM_FLAG_UPDATE
*\*\          - TIM_FLAG_COM
*\*\          - TIM_FLAG_TRIG
*\*\          - TIM_FLAG_BREAK
*\*\          - TIM_FLAG_LBKP
*\*\          - TIM_FLAG_PBKP
*\*\          - TIM_FLAG_COMP
*\*\          - TIM_FLAG_IOM
*\*\          - TIM_FLAG_C3LDCNT
*\*\return  The new state of TIM_FLAG (SET or RESET).
**/
FlagStatus TIM_GetFlagStatus(TIM_Module* TIM_OUTPWM, uint32_t TIM_FLAG)
{
    INTStatus bitstatus ;

    if ((TIM_OUTPWM->STS & TIM_FLAG) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
*\*\name    TIM_ClearFlag
*\*\fun     Clears the TIM_OUTPWM's pending flags.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\param   TIM_FLAG :
*\*\          - TIM_FLAG_CC1
*\*\          - TIM_FLAG_CC2
*\*\          - TIM_FLAG_CC3
*\*\          - TIM_FLAG_CC4
*\*\          - TIM_FLAG_CC5
*\*\          - TIM_FLAG_CC6
*\*\          - TIM_FLAG_CC7
*\*\          - TIM_FLAG_CC1OF
*\*\          - TIM_FLAG_CC2OF
*\*\          - TIM_FLAG_CC3OF
*\*\          - TIM_FLAG_CC4OF
*\*\          - TIM_FLAG_UPDATE
*\*\          - TIM_FLAG_COM
*\*\          - TIM_FLAG_TRIG
*\*\          - TIM_FLAG_BREAK
*\*\          - TIM_FLAG_LBKP
*\*\          - TIM_FLAG_PBKP
*\*\          - TIM_FLAG_COMP
*\*\          - TIM_FLAG_IOM
*\*\          - TIM_FLAG_C3LDCNT
*\*\return  none.
**/
void TIM_ClearFlag(TIM_Module* TIM_OUTPWM, uint32_t TIM_FLAG)
{
    /* Clear the flags */
    TIM_OUTPWM->STS = (uint32_t)(~TIM_FLAG);
}

/**
*\*\name    TIM_GetIntStatus
*\*\fun     Checks whether the TIM interrupt has occurred or not.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\param   TIM_IT :
*\*\          - TIM_INT_UPDATE
*\*\          - TIM_INT_CC1
*\*\          - TIM_INT_CC2
*\*\          - TIM_INT_CC3
*\*\          - TIM_INT_CC4
*\*\          - TIM_INT_CC5
*\*\          - TIM_INT_CC6
*\*\          - TIM_INT_CC7
*\*\          - TIM_INT_C3LDCNT
*\*\          - TIM_INT_COM
*\*\          - TIM_INT_TRIG
*\*\          - TIM_INT_BREAK
*\*\return  The new state of the TIM_IT(SET or RESET).
**/
INTStatus TIM_GetIntStatus(TIM_Module* TIM_OUTPWM, uint32_t TIM_IT)
{
    INTStatus bitstatus ;
    uint32_t itstatus = 0x0, itenable;
    if(TIM_IT == TIM_INT_UPDATE)
    {
        itstatus = TIM_OUTPWM->STS & TIM_FLAG_UPDATE;
    }
    else if(TIM_IT == TIM_INT_CC1)
    {
        itstatus = TIM_OUTPWM->STS & TIM_FLAG_CC1;
    }  
    else if(TIM_IT == TIM_INT_CC2)
    {
        itstatus = TIM_OUTPWM->STS & TIM_FLAG_CC2;
    }  
    else if(TIM_IT == TIM_INT_CC3)
    {
        itstatus = TIM_OUTPWM->STS & TIM_FLAG_CC3;
    }  
    else if(TIM_IT == TIM_INT_CC4)
    {
        itstatus = TIM_OUTPWM->STS & TIM_FLAG_CC4;
    }  
    else if(TIM_IT == TIM_INT_CC5)
    {
        itstatus = TIM_OUTPWM->STS & TIM_FLAG_CC5;
    }
    else if(TIM_IT == TIM_INT_CC6)
    {
        itstatus = TIM_OUTPWM->STS & TIM_FLAG_CC6;
    }
    else if(TIM_IT == TIM_INT_CC7)
    {
        itstatus = TIM_OUTPWM->STS & TIM_FLAG_CC7;
    }
    else if(TIM_IT == TIM_INT_C3LDCNT)
    {
        itstatus = TIM_OUTPWM->STS & TIM_FLAG_C3LDCNT;
    }
    else if(TIM_IT == TIM_INT_COM)
    {
        itstatus = TIM_OUTPWM->STS & TIM_FLAG_COM;
    }  
    else if(TIM_IT == TIM_INT_TRIG)
    {
        itstatus = TIM_OUTPWM->STS & TIM_FLAG_TRIG;
    } 
    else if(TIM_IT == TIM_INT_BREAK)
    {
        itstatus = TIM_OUTPWM->STS & TIM_FLAG_BREAK;
    }  
    else
    {
        /* No process */
    } 

    itenable = TIM_OUTPWM->DINTEN & TIM_IT;
    if ((itstatus != (uint32_t)RESET) && (itenable != (uint32_t)RESET))
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
*\*\name    TIM_ClrIntPendingBit
*\*\fun     Clears the TIM_OUTPWM's interrupt pending bits.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM1
*\*\          - TIM3
*\*\          - TIM4
*\*\          - TIM6
*\*\param   TIM_IT :
*\*\          - TIM_INT_UPDATE
*\*\          - TIM_INT_CC1
*\*\          - TIM_INT_CC2
*\*\          - TIM_INT_CC3
*\*\          - TIM_INT_CC4
*\*\          - TIM_INT_CC5
*\*\          - TIM_INT_CC6
*\*\          - TIM_INT_CC7
*\*\          - TIM_INT_C3LDCNT
*\*\          - TIM_INT_COM
*\*\          - TIM_INT_TRIG
*\*\          - TIM_INT_BREAK
*\*\return  none.
**/
void TIM_ClrIntPendingBit(TIM_Module* TIM_OUTPWM, uint32_t TIM_IT)
{
    /* Clear the IT pending Bit */
    if(TIM_IT == TIM_INT_UPDATE)
    {
        TIM_OUTPWM->STS = (uint32_t)(~TIM_FLAG_UPDATE);
    }
    else if(TIM_IT == TIM_INT_CC1)
    {
        TIM_OUTPWM->STS = (uint32_t)(~TIM_FLAG_CC1);
    }  
    else if(TIM_IT == TIM_INT_CC2)
    {
        TIM_OUTPWM->STS = (uint32_t)(~TIM_FLAG_CC2);
    }  
    else if(TIM_IT == TIM_INT_CC3)
    {
        TIM_OUTPWM->STS = (uint32_t)(~TIM_FLAG_CC3);
    }  
    else if(TIM_IT == TIM_INT_CC4)
    {
        TIM_OUTPWM->STS = (uint32_t)(~TIM_FLAG_CC4);
    }  
    else if(TIM_IT == TIM_INT_CC5)
    {
        TIM_OUTPWM->STS = (uint32_t)(~TIM_FLAG_CC5);
    }  
    else if(TIM_IT == TIM_INT_CC6)
    {
        TIM_OUTPWM->STS = (uint32_t)(~TIM_FLAG_CC6);
    }  
    else if(TIM_IT == TIM_INT_CC7)
    {
        TIM_OUTPWM->STS = (uint32_t)(~TIM_FLAG_CC7);
    }  
    else if(TIM_IT == TIM_INT_C3LDCNT)
    {
        TIM_OUTPWM->STS = (uint32_t)(~TIM_FLAG_C3LDCNT);
    } 
    else if(TIM_IT == TIM_INT_COM)
    {
        TIM_OUTPWM->STS = (uint32_t)(~TIM_FLAG_COM);
    }  
    else if(TIM_IT == TIM_INT_TRIG)
    {
        TIM_OUTPWM->STS = (uint32_t)(~TIM_FLAG_TRIG);
    } 
    else if(TIM_IT == TIM_INT_BREAK)
    {
        TIM_OUTPWM->STS = (uint32_t)(~TIM_FLAG_BREAK);
    }  
    else
    {
        /* No process */        
    }      
}

/**
*\*\name    TIM_Asymmetric_Enable.
*\*\fun     Enable or disable asymmetric mode in center-aligned.
*\*\param   TIM_OUTPWM:
*\*\          - TIM1
*\*\param   Cmd
*\*\          - ENABLE
*\*\          - DISABLE
*\*\return  none
**/
void TIM_AsymmetricEnable(TIM_Module* TIM_OUTPWM, FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Set the ASMMETRIC Bit */
        TIM_OUTPWM->CTRL1 |= (uint32_t)TIM_CTRL1_ASMMETRIC;
    }
    else
    {
        /* Reset the ASMMETRIC Bit */
        TIM_OUTPWM->CTRL1 &= (uint32_t)(~((uint32_t)TIM_CTRL1_ASMMETRIC));
    }
}


/**
*\*\name    TIM_IC1FiltConfig
*\*\fun     Config the filter of channel1.
*\*\param   TIM_OUTPWM:
*\*\          - TIM4 
*\*\param   TIM_FiltInitStruct: 
*\*\          - refer to the definition of TIM_FiltInitType
*\*\return  none
**/
void TIM_IC1FiltConfig(TIM_Module* TIM_OUTPWM, TIM_FiltInitType* TIM_FiltInitStruct)
{
    uint32_t temp_chxfilt = 0;
    
    temp_chxfilt &= (uint32_t)(((uint32_t) ~((uint32_t)TIM_C1FILT_THRESH)) & 
                             ((uint32_t) ~((uint32_t)TIM_C1FILT_WSIZE)));

