2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_tim.c
    temp_chxfilt |= (uint32_t)((TIM_FiltInitStruct->ThreshHold << (uint32_t)(0x18)) | 
                             (TIM_FiltInitStruct->WindowSize << (uint32_t)(0x11)));
 

    TIM_OUTPWM->C1FILT = temp_chxfilt;
    RCC_ConfigTIM4Filter(TIM_FiltInitStruct->Prescaler);
}

/**
*\*\name    TIM_IC2FiltConfig
*\*\fun     Config the filter of channel2.
*\*\param   TIM_OUTPWM:
*\*\          - TIM4 
*\*\param   TIM_FiltInitStruct: 
*\*\          - refer to the definition of TIM_FiltInitType
*\*\return  none
**/
void TIM_IC2FiltConfig(TIM_Module* TIM_OUTPWM, TIM_FiltInitType* TIM_FiltInitStruct)
{
    uint32_t temp_chxfilt = 0;
    
    temp_chxfilt &= (uint32_t)(((uint32_t) ~((uint32_t)TIM_C2FILT_THRESH)) & 
                             ((uint32_t) ~((uint32_t)TIM_C2FILT_WSIZE)));

    temp_chxfilt |= (uint32_t)((TIM_FiltInitStruct->ThreshHold << (uint32_t)(0x18)) | 
                             (TIM_FiltInitStruct->WindowSize << (uint32_t)(0x11)));

    TIM_OUTPWM->C2FILT = temp_chxfilt;
    RCC_ConfigTIM4Filter(TIM_FiltInitStruct->Prescaler);          
}

/**
*\*\name    TIM_IC3FiltConfig
*\*\fun     Config the filter of channel3.
*\*\param   TIM_OUTPWM:
*\*\          - TIM4 
*\*\param   TIM_FiltInitStruct: 
*\*\          - refer to the definition of TIM_FiltInitType
*\*\return  none
**/
void TIM_IC3FiltConfig(TIM_Module* TIM_OUTPWM, TIM_FiltInitType* TIM_FiltInitStruct)
{
    uint32_t temp_chxfilt = 0;
    
    temp_chxfilt &= (uint32_t)(((uint32_t) ~((uint32_t)TIM_C3FILT_THRESH)) & 
                             ((uint32_t) ~((uint32_t)TIM_C3FILT_WSIZE)));

    temp_chxfilt |= (uint32_t)((TIM_FiltInitStruct->ThreshHold << (uint32_t)(0x18)) | 
                             (TIM_FiltInitStruct->WindowSize << (uint32_t)(0x11)));

    TIM_OUTPWM->C3FILT = temp_chxfilt;
    RCC_ConfigTIM4Filter(TIM_FiltInitStruct->Prescaler);   
}

/**
*\*\name    TIM_IC1FiltEnable
*\*\fun     Enable or disable the filter of channel1.
*\*\param   TIM_OUTPWM:
*\*\          - TIM4
*\*\param   Cmd :
*\*\          - ENABLE
*\*\          - DISABLE
*\*\return  none
**/
void TIM_IC1FiltEnable(TIM_Module* TIM_OUTPWM,FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Enable the filter of CH1 */
        TIM_OUTPWM->C1FILT |= (uint32_t)TIM_C1FILT_FILTEN;
    }
    else
    {
        /* Disable the filter of CH1 */
        TIM_OUTPWM->C1FILT &= (uint32_t)(~TIM_C1FILT_FILTEN);
    }
}

/**
*\*\name    TIM_IC2FiltEnable
*\*\fun     Enable or disable the filter of channel2.
*\*\param   TIM_OUTPWM:
*\*\          - TIM4
*\*\param   Cmd :
*\*\          - ENABLE
*\*\          - DISABLE
*\*\return  none
**/
void TIM_IC2FiltEnable(TIM_Module* TIM_OUTPWM,FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Enable the filter of CH2 */
        TIM_OUTPWM->C2FILT |= (uint32_t)TIM_C2FILT_FILTEN;
    }
    else
    {
        /* Disable the filter of CH2 */
        TIM_OUTPWM->C2FILT &= (uint32_t)(~TIM_C2FILT_FILTEN);
    }
}

/**
*\*\name    TIM_IC3FiltEnable
*\*\fun     Enable or disable the filter of channel3.
*\*\param   TIM_OUTPWM:
*\*\          - TIM4
*\*\param   Cmd :
*\*\          - ENABLE
*\*\          - DISABLE
*\*\return  none
**/
void TIM_IC3FiltEnable(TIM_Module* TIM_OUTPWM,FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Enable the filter of CH3 */
        TIM_OUTPWM->C3FILT |= (uint32_t)TIM_C3FILT_FILTEN;
    }
    else
    {
        /* Disable the filter of CH3 */
        TIM_OUTPWM->C3FILT &= (uint32_t)(~TIM_C3FILT_FILTEN);
    }
}


/**
*\*\name    TIM_GetFiltStatus
*\*\fun     Checks the specified filter status.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM4
*\*\param   TIM_FiltFlag :
*\*\          - TIM_C1FILTO
*\*\          - TIM_C2FILTO
*\*\          - TIM_C3FILTO
*\*\return  The new state of TIM_FiltFlag (SET or RESET).
**/
FlagStatus TIM_GetFiltStatus(TIM_Module* TIM_OUTPWM, uint32_t TIM_FiltFlag)
{
    INTStatus bitstatus ;

    if ((TIM_OUTPWM->FILTO & TIM_FiltFlag) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
*\*\name    TIM_TrgiLoadLvrToCNTEnable
*\*\fun     The TRGI signal triggers the loading of the ENCLVR value into the CNT.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM3
*\*\param   Cmd :
*\*\          - ENABLE
*\*\          - DISABLE
*\*\return  none
**/
void TIM_TrgiLoadLvrToCNTEnable(FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Enable the TRGI signal triggers the loading of the ENCLVR value into the CNT. */
        TIM3->CTRL1 |= (uint32_t)TIM_CTRL1_TRGLDCNTEN;
    }
    else
    {
        /* Disable the TRGI signal triggers the loading of the ENCLVR value into the CNT. */
        TIM3->CTRL1 &= (uint32_t)(~TIM_CTRL1_TRGLDCNTEN);
    }

}

/**
*\*\name    TIM_GetLVR
*\*\fun     Get the TIM_OUTPWM LVR value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM3
*\*\          - TIM4
*\*\return  ENCLVR Register value.
**/
uint32_t TIM_GetLVR(TIM_Module* TIM_OUTPWM)
{
    uint32_t tempvalue;
    if(TIM_OUTPWM==TIM3)
    {
        /* Get ENCLVR Register value */
        tempvalue = (uint32_t)((uint16_t)(TIM_OUTPWM->ENCLVR));
    }
    else
    {
        /* Get ENCLVR Register value */
        tempvalue = (uint32_t)(TIM_OUTPWM->ENCLVR);
    }
    return tempvalue;
}

/**
*\*\name    TIM_CH3LoadLvrToCNTEnable
*\*\fun     The CH3 triggers the loading of the ENCLVR value into the CNT.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM4
*\*\param   Cmd :
*\*\          - ENABLE
*\*\          - DISABLE
*\*\return  none
**/
void TIM_CH3LoadLvrToCNTEnable(FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        /* Enable the CH3 triggers the loading of the ENCLVR value into the CNT. */
        TIM4->ENCMCTRL |= (uint32_t)TIM_ENCMCTRL_C3LDCNTEN;
    }
    else
    {
        /* Disable the CH3 triggers the loading of the ENCLVR value into the CNT. */
        TIM4->ENCMCTRL &= (uint32_t)(~TIM_ENCMCTRL_C3LDCNTEN);
    }

}

/**
*\*\name    TIM_CH3LoadLvrToCNTPolarity
*\*\fun     Config CH3 Polarity to trigger ENCLVR value loading into the CNT.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM4
*\*\param   Polarity :
*\*\          - TIM_CH3_POLARITY_HIGH
*\*\          - TIM_CH3_POLARITY_LOW
*\*\          - TIM_CH3_POLARITY_RISING
*\*\          - TIM_CH3_POLARITY_FALLING
*\*\return  none
**/
void TIM_CH3LoadLvrToCNTPolarity(uint32_t Polarity)
{
    uint32_t tmpencmctrl ;
    tmpencmctrl = TIM4->ENCMCTRL;
    /* Config the C3LDCNTSEL Bit */
    tmpencmctrl &= (uint32_t)(~((uint32_t)TIM_ENCMCTRL_C3LDCNTSEL));
    tmpencmctrl |= (uint32_t)Polarity;
    /* Write to TIM_OUTPWM ENCMCTRL register */
    TIM4->ENCMCTRL = tmpencmctrl;

}

/**
*\*\name    TIM_GetENCDAT
*\*\fun     Gets the TIM_OUTPWM ENCDAT value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM4
*\*\return  ENCDAT Register value.
**/
uint32_t TIM_GetENCDAT(TIM_Module* TIM_OUTPWM)
{
    /* Get ENCDAT Register value */
    return (uint32_t)TIM_OUTPWM->ENCDAT;
}

/**
*\*\name    TIM_GetENCDATSign
*\*\fun     Get the sign of TIM_OUTPWM ENCDAT value.
*\*\param   TIM_OUTPWM (The input parameters must be the following values):
*\*\          - TIM4
*\*\return  Sign of TIM_OUTPWM ENCDAT value.
**/
uint32_t TIM_GetENCDATSign(TIM_Module* TIM_OUTPWM)
{
    /* Get the sign of TIM_OUTPWM ENCDAT value. */
    return (uint32_t)(TIM_OUTPWM->ENCMCTRL >> 31);
}

